buoyantCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22000;
    }
    topAndBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       22400;
    }
    cold
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       25600;
    }
    hot
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       25800;
    }
)

// ************************************************************************* //
